gap> F:=FreeGroup(80);;

gap> f1:=F.1;;f2:=F.2;;f3:=F.3;;f4:=F.4;;f5:=F.5;;f6:=F.6;;f7:=F.7;;f8:=F.8;;f9:=F.9;;f10:=F.10;;
>    f11:=F.11;;f12:=F.12;;f13:=F.13;;f14:=F.14;;f15:=F.15;;f16:=F.16;;f17:=F.17;;f18:=F.18;;f19:=F.19;;f20:=F.20;;
>    f21:=F.21;;f22:=F.22;;f23:=F.23;;f24:=F.24;;f25:=F.25;;f26:=F.26;;f27:=F.27;;f28:=F.28;;f29:=F.29;;f30:=F.30;;
>    f31:=F.31;;f32:=F.32;;f33:=F.33;;f34:=F.34;;f35:=F.35;;f36:=F.36;;f37:=F.37;;f38:=F.38;;f39:=F.39;;f40:=F.40;;
>    f41:=F.41;;f42:=F.42;;f43:=F.43;;f44:=F.44;;f45:=F.45;;f46:=F.46;;f47:=F.47;;f48:=F.48;;f49:=F.49;;f50:=F.50;;
>    f51:=F.51;;f52:=F.52;;f53:=F.53;;f54:=F.54;;f55:=F.55;;f56:=F.56;;f57:=F.57;;f58:=F.58;;f59:=F.59;;f60:=F.60;;
>    f61:=F.61;;f62:=F.62;;f63:=F.63;;f64:=F.64;;f65:=F.65;;f66:=F.66;;f67:=F.67;;f68:=F.68;;f69:=F.69;;f70:=F.70;;
>    f71:=F.71;;f72:=F.72;;f73:=F.73;;f74:=F.74;;f75:=F.75;;f76:=F.76;;f77:=F.77;;f78:=F.78;;f79:=F.79;;f80:=F.80;;


gap> G:=F/[f42^-1*f63*f18^-1*f22*f2^-1*f12*f63^-1*f25*f76^-1, f44^-1*f40*f19^-1*f21*f4^-1*f9*f40^-1*f24*f77^-1, 
>   f39^-1*f65*f17^-1*f20*f6^-1*f16*f65^-1*f26*f75^-1, f52^-1*f68*f13^-1*f19*f9^-1*f12*f68^-1*f33*f78^-1, 
>   f57^-1*f70*f15^-1*f18*f12^-1*f16*f70^-1*f34*f79^-1, f55^-1*f69*f10^-1*f17*f16^-1*f9*f69^-1*f35*f60^-1, 
>   f59^-1*f47*f22^-1*f15*f16^-1*f2*f47^-1*f28*f80^-1, f62^-1*f51*f21^-1*f13*f12^-1*f4*f51^-1*f30*f58^-1, 
>   f61^-1*f49*f20^-1*f10*f9^-1*f6*f49^-1*f32*f54^-1, f46^-1*f53*f5^-1*f7*f6^-1*f4*f53^-1*f36*f41^-1, 
>   f48^-1*f72*f3^-1*f5*f4^-1*f2*f72^-1*f38*f45^-1, f50^-1*f56*f7^-1*f3*f2^-1*f6*f56^-1*f37*f43^-1, 
>   f11^-1*f16*f66^-1*f77*f24^-1*f65*f16^-1*f4*f21^-1, f14^-1*f9*f67^-1*f76*f25^-1*f40*f9^-1*f2*f22^-1, 
>   f8^-1*f12*f64^-1*f75*f26^-1*f63*f12^-1*f6*f20^-1, f14^-1*f4*f71^-1*f80*f28^-1*f53*f4^-1*f16*f15^-1, 
>   f11^-1*f6*f74^-1*f58*f30^-1*f56*f6^-1*f12*f13^-1, f8^-1*f2*f73^-1*f54*f32^-1*f72*f2^-1*f9*f10^-1, 
>   f11^-1*f2*f73^-1*f78*f33^-1*f47*f2^-1*f9*f19^-1, f14^-1*f6*f74^-1*f79*f34^-1*f49*f6^-1*f12*f18^-1, 
>   f8^-1*f4*f71^-1*f60*f35^-1*f51*f4^-1*f16*f17^-1, f1^-1*f12*f64^-1*f41*f36^-1*f68*f12^-1*f6*f7^-1, 
>   f1^-1*f9*f67^-1*f43*f37^-1*f69*f9^-1*f2*f3^-1, f1^-1*f16*f66^-1*f45*f38^-1*f70*f16^-1*f4*f5^-1, 
>   f59^-1*f33*f43^-1*f67*f40^-1*f65*f33^-1*f68*f60^-1, f62^-1*f35*f45^-1*f66*f65^-1*f63*f35^-1*f69*f79^-1, 
>   f61^-1*f34*f41^-1*f64*f63^-1*f40*f34^-1*f70*f78^-1, f44^-1*f25*f54^-1*f73*f47^-1*f53*f25^-1*f63*f45^-1, 
>   f42^-1*f26*f58^-1*f74*f49^-1*f72*f26^-1*f65*f43^-1, f39^-1*f24*f80^-1*f71*f51^-1*f56*f24^-1*f40*f41^-1, 
>   f57^-1*f38*f60^-1*f71*f53^-1*f68*f38^-1*f72*f58^-1, f52^-1*f36*f79^-1*f74*f56^-1*f69*f36^-1*f53*f54^-1, 
>   f55^-1*f37*f78^-1*f73*f72^-1*f70*f37^-1*f56*f80^-1, f50^-1*f30*f75^-1*f64*f68^-1*f47*f30^-1*f51*f76^-1, 
>   f46^-1*f28*f77^-1*f66*f70^-1*f49*f28^-1*f47*f75^-1, f48^-1*f32*f76^-1*f67*f69^-1*f51*f32^-1*f49*f77^-1, 
>   f52^-1*f28*f77^-1*f45*f63^-1*f24*f28^-1*f47*f73^-1, f57^-1*f32*f76^-1*f43*f65^-1*f25*f32^-1*f49*f74^-1, 
>   f55^-1*f30*f75^-1*f41*f40^-1*f26*f30^-1*f51*f71^-1, f42^-1*f24*f80^-1*f60*f68^-1*f28*f24^-1*f40*f67^-1, 
>   f44^-1*f26*f58^-1*f79*f69^-1*f30*f26^-1*f65*f66^-1, f39^-1*f25*f54^-1*f78*f70^-1*f32*f25^-1*f63*f64^-1, 
>   f62^-1*f37*f78^-1*f54*f53^-1*f33*f37^-1*f56*f74^-1, f59^-1*f36*f79^-1*f58*f72^-1*f34*f36^-1*f53*f71^-1, 
>   f61^-1*f38*f60^-1*f80*f56^-1*f35*f38^-1*f72*f73^-1, f48^-1*f34*f41^-1*f75*f47^-1*f36*f34^-1*f70*f66^-1, 
>   f46^-1*f33*f43^-1*f76*f51^-1*f37*f33^-1*f68*f64^-1, f50^-1*f35*f45^-1*f77*f49^-1*f38*f35^-1*f69*f67^-1, 
>   f27^-1*f53*f5^-1*f3*f26^-1*f25*f53^-1*f36*f10^-1, f29^-1*f56*f7^-1*f5*f25^-1*f24*f56^-1*f37*f15^-1, 
>   f31^-1*f72*f3^-1*f7*f24^-1*f26*f72^-1*f38*f13^-1, f23^-1*f65*f17^-1*f10*f36^-1*f33*f65^-1*f26*f3^-1, 
>   f23^-1*f40*f19^-1*f13*f38^-1*f34*f40^-1*f24*f7^-1, f23^-1*f63*f18^-1*f15*f37^-1*f35*f63^-1*f25*f5^-1, 
>   f31^-1*f49*f20^-1*f17*f33^-1*f28*f49^-1*f32*f21^-1, f27^-1*f47*f22^-1*f18*f35^-1*f30*f47^-1*f28*f20^-1, 
>   f29^-1*f51*f21^-1*f19*f34^-1*f32*f51^-1*f30*f22^-1, f29^-1*f69*f10^-1*f20*f28^-1*f36*f69^-1*f35*f18^-1, 
>   f27^-1*f68*f13^-1*f21*f32^-1*f38*f68^-1*f33*f17^-1, f31^-1*f70*f15^-1*f22*f30^-1*f37*f70^-1*f34*f19^-1];;
gap> GroupSatisfiesTauPrime(G);
2.11111
gap> GroupSatisfiesC(G,6);
false


gap> G:=F/[f52*f73*f58^-1*f57^-1*f32*f4^-1*f11*f21*f53^-1, f55*f71*f54^-1*f52^-1*f28*f6^-1*f8*f20*f56^-1, 
>       f57*f74*f80^-1*f55^-1*f30*f2^-1*f14*f22*f72^-1, f42*f67*f79^-1*f62^-1*f37*f16^-1*f14*f15*f65^-1, 
>       f39*f64*f60^-1*f59^-1*f36*f9^-1*f8*f10*f40^-1, f44*f66*f78^-1*f61^-1*f38*f12^-1*f11*f13*f63^-1, 
>       f48*f66*f43^-1*f42^-1*f24*f6^-1*f1*f7*f49^-1, f46*f64*f45^-1*f44^-1*f26*f2^-1*f1*f3*f47^-1,
>       f50*f67*f41^-1*f39^-1*f25*f4^-1*f1*f5*f51^-1, f62*f74*f77^-1*f48^-1*f34*f9^-1*f11*f19*f69^-1, 
>       f59*f71*f76^-1*f50^-1*f35*f12^-1*f14*f18*f68^-1, 
>       f61*f73*f75^-1*f46^-1*f33*f16^-1*f8*f17*f70^-1, f59*f80*f74^-1*f62^-1*f51*f25^-1*f42*f76*f53^-1, 
>       f61*f54*f71^-1*f59^-1*f47*f26^-1*f39*f75*f72^-1, f62*f58*f73^-1*f61^-1*f49*f24^-1*f44*f77*f56^-1, 
>       f44*f77*f74^-1*f57^-1*f70*f33^-1*f52*f78*f65^-1, f39*f75*f73^-1*f52^-1*f68*f35^-1*f55*f60*f63^-1, 
>       f42*f76*f71^-1*f55^-1*f69*f34^-1*f57*f79*f40^-1, f50*f43*f66^-1*f44^-1*f40*f36^-1*f46*f41*f69^-1, 
>       f46*f41*f67^-1*f42^-1*f63*f38^-1*f48*f45*f68^-1, f48*f45*f64^-1*f39^-1*f65*f37^-1*f50*f43*f70^-1, 
>       f57*f79*f67^-1*f50^-1*f56*f28^-1*f59*f80*f49^-1, f52*f78*f66^-1*f48^-1*f72*f30^-1*f62*f58*f47^-1, 
>       f55*f60*f64^-1*f46^-1*f53*f32^-1*f61*f54*f51^-1, f11*f19*f79^-1*f57^-1*f38*f63^-1*f44*f45*f12^-1, 
>       f8*f17*f78^-1*f52^-1*f36*f40^-1*f39*f41*f9^-1, f14*f18*f60^-1*f55^-1*f37*f65^-1*f42*f43*f16^-1, 
>       f14*f22*f58^-1*f62^-1*f35*f68^-1*f59*f60*f12^-1, f8*f20*f80^-1*f59^-1*f33*f70^-1*f61*f78*f16^-1, 
>       f11*f21*f54^-1*f61^-1*f34*f69^-1*f62*f79*f9^-1, f1*f5*f76^-1*f42^-1*f26*f47^-1*f46*f75*f2^-1, 
>       f1*f7*f77^-1*f44^-1*f25*f51^-1*f50*f76*f4^-1, f1*f3*f75^-1*f39^-1*f24*f49^-1*f48*f77*f6^-1, 
>       f11*f13*f45^-1*f48^-1*f32*f53^-1*f52*f54*f4^-1, f14*f15*f43^-1*f50^-1*f30*f72^-1*f57*f58*f2^-1, 
>       f8*f10*f41^-1*f46^-1*f28*f56^-1*f55*f80*f6^-1, f29*f18*f13^-1*f11^-1*f2*f26^-1*f23*f3*f30^-1, 
>       f27*f17*f15^-1*f14^-1*f6*f24^-1*f23*f7*f28^-1, f31*f19*f10^-1*f8^-1*f4*f25^-1*f23*f5*f32^-1, 
>       f31*f13*f18^-1*f14^-1*f9*f36^-1*f27*f10*f34^-1, f27*f10*f19^-1*f11^-1*f16*f37^-1*f29*f15*f33^-1, 
>       f29*f15*f17^-1*f8^-1*f12*f38^-1*f31*f13*f35^-1, f23*f5*f21^-1*f11^-1*f6*f28^-1*f27*f20*f24^-1, 
>       f23*f3*f22^-1*f14^-1*f4*f32^-1*f31*f21*f25^-1, f23*f7*f20^-1*f8^-1*f2*f30^-1*f29*f22*f26^-1, 
>       f29*f22*f3^-1*f1^-1*f16*f33^-1*f27*f17*f37^-1, f31*f21*f5^-1*f1^-1*f12*f35^-1*f29*f18*f38^-1, 
>       f27*f20*f7^-1*f1^-1*f9*f34^-1*f31*f19*f36^-1, f57*f58*f22^-1*f29^-1*f69*f40^-1*f42*f67*f34^-1, 
>       f52*f54*f21^-1*f31^-1*f70*f65^-1*f44*f66*f33^-1, f55*f80*f20^-1*f27^-1*f68*f63^-1*f39*f64*f35^-1, 
>       f62*f79*f19^-1*f31^-1*f72*f47^-1*f52*f73*f30^-1, f59*f60*f18^-1*f29^-1*f56*f49^-1*f57*f74*f28^-1, 
>       f61*f78*f17^-1*f27^-1*f53*f51^-1*f55*f71*f32^-1, f42*f43*f15^-1*f29^-1*f51*f53^-1*f59*f71*f25^-1, 
>       f44*f45*f13^-1*f31^-1*f49*f56^-1*f62*f74*f24^-1, f39*f41*f10^-1*f27^-1*f47*f72^-1*f61*f73*f26^-1, 
>       f48*f77*f7^-1*f23^-1*f63*f68^-1*f46*f64*f38^-1, f50*f76*f5^-1*f23^-1*f65*f70^-1*f48*f66*f37^-1, 
>       f46*f75*f3^-1*f23^-1*f40*f69^-1*f50*f67*f36^-1 ];;
gap> GroupSatisfiesTauPrime(G);
2.44444
gap> GroupSatisfiesC(G,6);
false
gap> GroupSatisfiesC(G,4);
true



gap> G:=F/[f13^-1*f31^-1*f34*f36^-1*f47*f72^-1*f70*f15^-1*f18, 
>       f10^-1*f27^-1*f33*f37^-1*f51*f53^-1*f68*f13^-1*f19, 
>       f15^-1*f29^-1*f35*f38^-1*f49*f56^-1*f69*f10^-1*f17, 
>       f18^-1*f29^-1*f30*f26^-1*f40*f69^-1*f51*f21^-1*f13, 
>       f17^-1*f27^-1*f28*f24^-1*f63*f68^-1*f47*f22^-1*f15, 
>       f19^-1*f31^-1*f32*f25^-1*f65*f70^-1*f49*f20^-1*f10, 
>       f3^-1*f23^-1*f25*f32^-1*f70*f65^-1*f63*f18^-1*f22, 
>       f5^-1*f23^-1*f24*f28^-1*f68*f63^-1*f40*f19^-1*f21, 
>       f7^-1*f23^-1*f26*f30^-1*f69*f40^-1*f65*f17^-1*f20, 
>       f21^-1*f31^-1*f38*f35^-1*f56*f49^-1*f72*f3^-1*f5, 
>       f22^-1*f29^-1*f37*f33^-1*f53*f51^-1*f56*f7^-1*f3, 
>       f20^-1*f27^-1*f36*f34^-1*f72*f47^-1*f53*f5^-1*f7, 
>       f43^-1*f50^-1*f69*f36^-1*f28*f56^-1*f35*f45^-1*f66, 
>       f41^-1*f46^-1*f68*f38^-1*f32*f53^-1*f33*f43^-1*f67, 
>       f45^-1*f48^-1*f70*f37^-1*f30*f72^-1*f34*f41^-1*f64, 
>       f54^-1*f61^-1*f72*f26^-1*f24*f49^-1*f38*f60^-1*f71, 
>       f80^-1*f59^-1*f53*f25^-1*f26*f47^-1*f36*f79^-1*f74, 
>       f58^-1*f62^-1*f56*f24^-1*f25*f51^-1*f37*f78^-1*f73, 
>       f75^-1*f39^-1*f63*f35^-1*f37*f65^-1*f25*f54^-1*f73, 
>       f77^-1*f44^-1*f65*f33^-1*f36*f40^-1*f26*f58^-1*f74, 
>       f76^-1*f42^-1*f40*f34^-1*f38*f63^-1*f24*f80^-1*f71, 
>       f60^-1*f55^-1*f51*f32^-1*f34*f69^-1*f30*f75^-1*f64, 
>       f79^-1*f57^-1*f49*f28^-1*f33*f70^-1*f32*f76^-1*f67, 
>       f78^-1*f52^-1*f47*f30^-1*f35*f68^-1*f28*f77^-1*f66, 
>       f66^-1*f48^-1*f49*f6^-1*f9*f34^-1*f32*f76^-1*f43, 
>       f64^-1*f46^-1*f47*f2^-1*f16*f33^-1*f28*f77^-1*f45, 
>       f67^-1*f50^-1*f51*f4^-1*f12*f35^-1*f30*f75^-1*f41, 
>       f71^-1*f55^-1*f56*f6^-1*f2*f30^-1*f37*f78^-1*f54, 
>       f73^-1*f52^-1*f53*f4^-1*f6*f28^-1*f36*f79^-1*f58, 
>       f74^-1*f57^-1*f72*f2^-1*f4*f32^-1*f38*f60^-1*f80, 
>       f64^-1*f39^-1*f40*f9^-1*f4*f25^-1*f24*f80^-1*f60, 
>       f67^-1*f42^-1*f65*f16^-1*f6*f24^-1*f26*f58^-1*f79, 
>       f66^-1*f44^-1*f63*f12^-1*f2*f26^-1*f25*f54^-1*f78, 
>       f73^-1*f61^-1*f70*f16^-1*f12*f38^-1*f34*f41^-1*f75, 
>       f74^-1*f62^-1*f69*f9^-1*f16*f37^-1*f35*f45^-1*f77, 
>       f71^-1*f59^-1*f68*f12^-1*f9*f36^-1*f33*f43^-1*f76, 
>       f7^-1*f1^-1*f4*f51^-1*f35*f12^-1*f16*f66^-1*f77, 
>       f5^-1*f1^-1*f2*f47^-1*f33*f16^-1*f9*f67^-1*f76, 
>       f3^-1*f1^-1*f6*f49^-1*f34*f9^-1*f12*f64^-1*f75, 
>       f20^-1*f8^-1*f16*f70^-1*f38*f12^-1*f4*f71^-1*f80, 
>       f22^-1*f14^-1*f12*f68^-1*f36*f9^-1*f6*f74^-1*f58, 
>       f21^-1*f11^-1*f9*f69^-1*f37*f16^-1*f2*f73^-1*f54, 
>       f17^-1*f8^-1*f9*f40^-1*f25*f4^-1*f2*f73^-1*f78, 
>       f19^-1*f11^-1*f12*f63^-1*f26*f2^-1*f6*f74^-1*f79, 
>       f18^-1*f14^-1*f16*f65^-1*f24*f6^-1*f4*f71^-1*f60, 
>       f10^-1*f8^-1*f6*f56^-1*f30*f2^-1*f12*f64^-1*f41, 
>       f15^-1*f14^-1*f2*f72^-1*f32*f4^-1*f9*f67^-1*f43, 
>       f13^-1*f11^-1*f4*f53^-1*f28*f6^-1*f16*f66^-1*f45, 
>       f76^-1*f50^-1*f37*f70^-1*f72*f30^-1*f56*f7^-1*f5, 
>       f77^-1*f48^-1*f38*f68^-1*f53*f32^-1*f72*f3^-1*f7, 
>       f75^-1*f46^-1*f36*f69^-1*f56*f28^-1*f53*f5^-1*f3, 
>       f78^-1*f61^-1*f32*f51^-1*f69*f34^-1*f49*f20^-1*f17, 
>       f79^-1*f62^-1*f30*f47^-1*f68*f35^-1*f51*f21^-1*f19, 
>       f60^-1*f59^-1*f28*f49^-1*f70*f33^-1*f47*f22^-1*f18, 
>       f80^-1*f55^-1*f35*f63^-1*f65*f37^-1*f69*f10^-1*f20, 
>       f58^-1*f57^-1*f34*f40^-1*f63*f38^-1*f70*f15^-1*f22, 
>       f54^-1*f52^-1*f33*f65^-1*f40*f36^-1*f68*f13^-1*f21, 
>       f41^-1*f39^-1*f26*f72^-1*f49*f24^-1*f65*f17^-1*f10, 
>       f45^-1*f44^-1*f24*f56^-1*f51*f25^-1*f40*f19^-1*f13, 
>       f43^-1*f42^-1*f25*f53^-1*f47*f26^-1*f63*f18^-1*f15];
<fp group of size infinity with 80 generators>
gap> GroupSatisfiesTauPrime(G);
2.11111
gap> GroupSatisfiesC(G,6);
false
gap> GroupSatisfiesC(G,4);
true
gap> GroupSatisfiesT(G,4);
false
gap> GroupSatisfiesCPrime(G,1/6);
false

